In [1]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/anhquan0412/dataset/main/Salaries.csv')
df.drop(columns=['Notes','Status', 'Agency'], inplace=True)
df['JobTitle'] = df['JobTitle'].str.title()

df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,1,NATHANIEL FORD,General Manager-Metropolitan Transit Authority,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011
1,2,GARY JIMENEZ,Captain Iii (Police Department),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,3,ALBERT PARDINI,Captain Iii (Police Department),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011
3,4,CHRISTOPHER CHONG,Wire Rope Cable Maintenance Mechanic,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011
4,5,PATRICK GARDNER,"Deputy Chief Of Department,(Fire Department)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011

In [2]:
df.head() #kiểm tra bảng có gì
df.info() #kiểm tra thông tin bảng có gì
df.describe() #thống kê dữ liệu
df.shape() # kiểm tra bảng có bao nhiêu dòng bao nhiêu cột

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
dtypes: float64(6), int64(2), object(2)
memory usage: 11.3+ MB

TypeError: 'tuple' object is not callable

In [ ]:
df.shape

(148654, 10)

In [ ]:
df.count()

Id                  148654
EmployeeName        148654
JobTitle            148654
BasePay             148045
OvertimePay         148650
OtherPay            148650
Benefits            112491
TotalPay            148654
TotalPayBenefits    148654
Year                148654
dtype: int64

In [ ]:
round(df['BasePay'].mean(),2)

66325.45

Which of the observations is FALSE about the San Francisco employees?

A. The size of the city government slightly grew from 2011 to 2014 (in term of number of employees)

B. However, average of total pay increased steadily throughout the years thanks to better payment policy.

C. The average amount of overtime pay also increased.

D. Maximum amount of Base Pay reached about 319.000 USD in 2014.


Correct answer : D

In [ ]:
df['Year'].value_counts().sort_index()

Year
2011    36159
2012    36766
2013    37606
2014    38123
Name: count, dtype: int64

In [ ]:
df.groupby("Year")["TotalPay"].mean()

Year
2011    71744.103871
2012    74113.262265
2013    77611.443142
2014    75463.918140
Name: TotalPay, dtype: float64

In [ ]:
df.groupby("Year")["OvertimePay"].mean()

Year
2011    4531.065429
2012    5023.417824
2013    5281.641980
2014    5401.993737
Name: OvertimePay, dtype: float64

In [ ]:
df[df["Year"] == 2014]["BasePay"].max()

318835.49

In [ ]:
# Kiểm tra số lượng giá trị Null ở các cột
df.isnull().sum()

Id                    0
EmployeeName          0
JobTitle              0
BasePay             609
OvertimePay           4
OtherPay              4
Benefits              0
TotalPay              0
TotalPayBenefits      0
Year                  0
dtype: int64

In [ ]:
# Biến Null thành 0
df['Benefits'].fillna(0, inplace= True)

/tmp/ipykernel_1025/4173114888.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Benefits'].fillna(0, inplace= True)

In [ ]:
#What is the name of the highest paid person (including benefits)?
#Giá trị + Null = Null (mún có kết quả phải biến Null thành số 0 (hoặc có số nào khác))
df['TotalPayBenefits'] = df['TotalPay'] + df['Benefits']

In [ ]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,1,NATHANIEL FORD,General Manager-Metropolitan Transit Authority,167411.18,0.00,400184.25,0.0,567595.43,567595.43,2011
1,2,GARY JIMENEZ,Captain Iii (Police Department),155966.02,245131.88,137811.38,0.0,538909.28,538909.28,2011
2,3,ALBERT PARDINI,Captain Iii (Police Department),212739.13,106088.18,16452.60,0.0,335279.91,335279.91,2011
3,4,CHRISTOPHER CHONG,Wire Rope Cable Maintenance Mechanic,77916.00,56120.71,198306.90,0.0,332343.61,332343.61,2011
4,5,PATRICK GARDNER,"Deputy Chief Of Department,(Fire Department)",134401.60,9737.00,182234.59,0.0,326373.19,326373.19,2011

In [ ]:
df.sort_values(by= 'TotalPay', ascending=[False])

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,1,NATHANIEL FORD,General Manager-Metropolitan Transit Authority,167411.18,0.00,400184.25,0.00,567595.43,567595.43,2011
1,2,GARY JIMENEZ,Captain Iii (Police Department),155966.02,245131.88,137811.38,0.00,538909.28,538909.28,2011
110531,110532,David Shinn,Deputy Chief 3,129150.01,0.00,342802.63,38780.04,471952.64,510732.68,2014
110532,110533,Amy P Hart,Asst Med Examiner,318835.49,10712.95,60563.54,89540.23,390111.98,479652.21,2014
36159,36160,Gary Altenberg,"Lieutenant, Fire Suppression",128808.87,220909.48,13126.31,44430.12,362844.66,407274.78,2012
...,...,...,...,...,...,...,...,...,...,...
106781,106782,Su-Wen McManus,Secretary 2,NaN,0.00,0.00,7959.18,0.00,7959.18,2013
106780,106781,Kimberly F Johnson,Transit Operator,NaN,0.00,0.00,7959.18,0.00,7959.18,2013
106779,106780,Jack L Brodnax Jr,Junior Management Assistant,NaN,0.00,0.00,7959.18,0.00,7959.18,2013
106778,106779,Ronald R Orge,Parking Control Officer,NaN,0.00,0.00,7959.18,0.00,7959.18,2013
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014

In [ ]:
max_salary = df['TotalPayBenefits'].max()

In [ ]:
#5
df[df['TotalPayBenefits'] == max_salary][['EmployeeName', 'TotalPayBenefits']]

     EmployeeName  TotalPayBenefits
0  NATHANIEL FORD         567595.43

In [ ]:
#6
df[df['EmployeeName']== 'NATHANIEL FORD']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,1,NATHANIEL FORD,General Manager-Metropolitan Transit Authority,167411.18,0.0,400184.25,0.0,567595.43,567595.43,2011

In [ ]:
#7+8
min_salary = df['TotalPayBenefits'].min()
df[df['TotalPayBenefits'] == min_salary][['EmployeeName', 'TotalPayBenefits','Year']]

       EmployeeName  TotalPayBenefits  Year
148653    Joe Lopez           -618.13  2014

In [ ]:
#9
#How many unique employees have the same Job Title with Liller Jackson in the dataset?

df[df['EmployeeName'] == 'Liller Jackson']
df[df['JobTitle'] == 'Counselor, Log Cabin Ranch'].nunique() 
#75


#Counselor, Log Cabin Ranch

Id                  91
EmployeeName        75
JobTitle             1
BasePay             88
OvertimePay         82
OtherPay            89
Benefits            52
TotalPay            91
TotalPayBenefits    63
Year                 4
dtype: int64

In [ ]:
#10 How many percentage of Special Nurse get paid overtime?
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,1,NATHANIEL FORD,General Manager-Metropolitan Transit Authority,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011
1,2,GARY JIMENEZ,Captain Iii (Police Department),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,3,ALBERT PARDINI,Captain Iii (Police Department),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011
3,4,CHRISTOPHER CHONG,Wire Rope Cable Maintenance Mechanic,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011
4,5,PATRICK GARDNER,"Deputy Chief Of Department,(Fire Department)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011

In [26]:
# Chuyển cột JobTitle về chữ thường để tránh lỗi chính tả
df['JobTitle'] = df['JobTitle'].str.lower()

# Lọc ra những người có JobTitle là "special nurse"
special_nurses = df[df['JobTitle'] == 'special nurse']

# Tính tổng số Special Nurse
total_special_nurses = special_nurses.shape[0]

# Tính số Special Nurse có OvertimePay > 0
special_nurses_with_overtime = special_nurses[special_nurses['OvertimePay'] > 0].shape[0]

# Tính phần trăm
percentage_overtime = (special_nurses_with_overtime / total_special_nurses) * 100 if total_special_nurses > 0 else 0

# Hiển thị kết quả
percentage_overtime

26.230357451217408